* github 設定
** emacs lisp 設定                                                 :noexport:
#+begin_src emacs-lisp
  ;; 如果沒有安裝就自動安裝
  (unless (package-installed-p 'yaml-mode)
    (package-refresh-contents)
    (package-install 'yaml-mode))

  ;; 讓 Org-babel 支援匯出與編輯 YAML
  (add-to-list 'org-src-lang-modes '("yaml" . yaml))
#+end_src

#+RESULTS:
: ((yaml . yaml) (html . web) (dot . graphviz-dot) (translate . text) (C . c) (C++ . c++) (asymptote . asy) (beamer . latex) (calc . fundamental) (cpp . c++) (ditaa . artist) (desktop . conf-desktop) (dot . fundamental) (elisp . emacs-lisp) (ocaml . tuareg) (screen . shell-script) (sqlite . sql) (toml . conf-toml) (shell . sh) (ash . sh) (sh . sh) (bash . sh) (jsh . sh) (bash2 . sh) (dash . sh) (dtksh . sh) (ksh . sh) (es . sh) (rc . sh) (itcsh . sh) (tcsh . sh) (jcsh . sh) (csh . sh) (ksh88 . sh) (oash . sh) (pdksh . sh) (mksh . sh) (posix . sh) (wksh . sh) (wsh . sh) (zsh . sh) (rpm . sh))

** publish.yml
#+begin_src yaml :tangle .github/workflows/publish.yml
  name: Publish ASME Calculation Slides

  on:
    push:
      branches:
        - main  # 或是您使用的分支名稱，如 master
    workflow_dispatch: # 允許手動觸發執行

  # 設定權限以允許部署到 GitHub Pages
  permissions:
    contents: read
    pages: write
    id-token: write

  concurrency:
    group: "pages"
    cancel-in-progress: false

  env:
    # 強制全域使用 Node 24
    FORCE_JAVASCRIPT_ACTIONS_TO_NODE24: true

  jobs:
    build:
      runs-on: ubuntu-latest
      steps:
        - name: Checkout Repository
          uses: actions/checkout@v4

        - name: Install System Dependencies
          run: |
            sudo apt-get update
            sudo apt-get install -y maxima emacs-nox

        - name: Setup Emacs Packages
          run: |
            # 建立 elpa 目錄並由 publish.el 進行套件安裝
            mkdir -p .elpa

        - name: Execute Build Script (Maxima + Org Export)
          run: |
            emacs --batch -l publish.el

        - name: Verify Output File
          run: |
            if [ ! -f "calculation.html" ]; then
              echo "❌ 錯誤：找不到 calculation.html，編譯可能失敗。"
              exit 1
            fi
            echo "✅ 成功產出 calculation.html"

        - name: Upload Pages Artifact
          uses: actions/upload-pages-artifact@v3
          with:
            # 部署根目錄下的所有內容
            path: '.'

    deploy:
      needs: build
      runs-on: ubuntu-latest
      environment:
        name: github-pages
        url: ${{ steps.deployment.outputs.page_url }}calculation.html
      steps:
        - name: Deploy to GitHub Pages
          id: deployment
          uses: actions/deploy-pages@v4
#+end_src
